sesion02/nota.tex
% Created 2018-08-16 Thu 19:10
% Intended LaTeX compiler: pdflatex
\documentclass[11pt]{article}
\usepackage[utf8]{inputenc}
\usepackage[T1]{fontenc}
\usepackage{graphicx}
\usepackage{grffile}
\usepackage{longtable}
\usepackage{wrapfig}
\usepackage{rotating}
\usepackage[normalem]{ulem}
\usepackage{amsmath}
\usepackage{textcomp}
\usepackage{amssymb}
\usepackage{capt-of}
\usepackage{hyperref}
\usepackage[spanish]{babel}
\usepackage{fancyvrb}
\author{Mauricio Esquivel Reyes}
\date{\today}
\title{Sesión de laboratorio 02}
\hypersetup{
 pdfauthor={Mauricio Esquivel Reyes},
 pdftitle={Sesión de laboratorio 02},
 pdfkeywords={},
 pdfsubject={},
 pdfcreator={Emacs 24.5.1 (Org mode 9.1.13)}, 
 pdflang={Spanish}}
\begin{document}

\maketitle
\tableofcontents

\section{Haskell}
\label{sec:org3a96a0d}
Para refrescar lo aprendido, en esta ocasión veremos algunas funciones con los
tipos por defecto de haskell.
\subsection{Funciones}
\label{sec:org64f6fb5}
\subsubsection{Potencia}
\label{sec:org895604b}
\begin{verbatim}
poteB :: Int -> Int -> Int
poteB x y = case y of 
        0 -> 1
        _ -> if y > 0 
        then x * (poteB x (y-1))
        else error $ "La potencia tiene que ser positiva, y = "++ show y
\end{verbatim}
\subsubsection{Toma primeros n elementos de una lista}
\label{sec:org2fa748d}
\begin{verbatim}
toma :: Int -> [a] -> [a]
toma 0 _ = []
toma _ [] = []
toma n (x:xs) = [x] ++ toma  
\end{verbatim}
\subsubsection{Mayores}
\label{sec:orga131e61}
\begin{verbatim}
mayores :: Ord a => [a] -> a -> [a]
mayores l a = [x | x <- l , x > a]
\end{verbatim}
\subsection{Tipos propios}
\label{sec:org3fd828f}
Definiremos a los números naturales y algunas funciones de estos.
\subsubsection{Definición}
\label{sec:org4d69e5c}
\begin{verbatim}
data Natural = Cero | Suc Natural deriving (Eq, Show)
let tres = (Suc (Suc (Suc Cero)))
\end{verbatim}
\subsubsection{Suma}
\label{sec:org24bd34c}
\begin{verbatim}
suma :: Natural -> Natural -> Natural
suma Cero x = x
suma (Suc x) y = Suc(suma x y)
\end{verbatim}
\subsubsection{Suma (Recursión estructural sobre y)}
\label{sec:org5cfaed5}
\begin{verbatim}
suma :: Natural -> Natural -> Natural
suma x y = case y of
     Cero -> x
     Suc z -> Suc (suma x z)
\end{verbatim}
\subsubsection{Producto}
\label{sec:orgda93837}
\begin{verbatim}
prod :: Natural -> Natural -> Natural
prod x y = case y of 
     Cero -> Cero
     Suc z -> suma (prod x z) x
\end{verbatim}
\subsubsection{Potencia}
\label{sec:org58b9989}
\begin{verbatim}
potN :: Natural -> Natural -> Natural
potN x y = case y of
     Cero -> Suc Cero
     Suc z -> prod (potN x z) x 
\end{verbatim}
\section{Lógica Proposicional}
\label{sec:org82dd96b}
\subsection{Sintaxis}
\label{sec:orgd58d379}
Esta es la sintaxis de la Lógica Proposicional que utilizaremos. 
\[PL ::= <ProposiciónAtómica> | \neg PL | (PL \land PL) | (PL \lor PL) | (PL \to PL) \]
\[<ProposiciónAtómica> ::= \top | \bot | <VariableProposicional>\]
\[<VariableProposicional> ::= v<Indice>\]
\[ <Indice> ::= [i | i \in \mathbb{N}]\]

\subsection{Definición en Haskell}
\label{sec:org23d3171}
\begin{verbatim}
-- Tipo de dato indice
type Indice = Int

-- Tipo de dato fórmula
data PL = Top | Bot  | Var Indice
              | Oneg PL 
              | Oand PL PL | Oor PL PL 
              | Oimp PL PL deriving (Eq, Show)
\end{verbatim}

\subsection{Funciones}
\label{sec:orgdc004a8}
\subsubsection{Elimina implicaciones}
\label{sec:orgffffae7}
\begin{verbatim}
quitaImp :: PL -> PL
quitaImp phi = case phi of
     Top -> Top
     Bot -> Bot
     Var x -> Var x
     Oneg x -> Oneg (quitaImp x)
     Oand x y -> Oand (quitaImp x) (quitaImp y)
     Oor x y -> Oor (quitaImp x) (quitaImp y)
     Oimp x y -> Oor (Oneg (quitaImp x)) (quitaImp y)
\end{verbatim}
\subsubsection{Forma Normal de Negación}
\label{sec:orgff3c985}
\begin{verbatim}
toNNF :: PL -> PL
toNNF phi = case quitaImp phi of
     Oneg (Oand x y) -> toNNF $ Oor (Oneg $ toNNF x) (Oneg $ toNNF y)
     Oneg (Oor x y) -> toNNF $ Oand (Oneg $ toNNF x) (Oneg $ toNNF y)
     Oneg (Oneg x) -> toNNF x
     Oand x y -> Oand (toNNF x) (toNNF y)
     Oor x y -> Oor (toNNF x) (toNNF y)
     Oneg x -> Oneg (toNNF x)
     x -> x
\end{verbatim}
\subsubsection{Variables de una formula}
\label{sec:org60efe3b}
\begin{verbatim}
varsOf :: PL -> [PL]
varsOf phi = case phi of
    Top -> []
    Bot -> []
    Var x -> [Var x]
    Oneg x -> varsOf x
    Oand x y -> varsOf x ++ varsOf y
    Oor x y -> varsOf x ++ varsOf y
    Oimp x y -> varsOf x ++ varsOf y
\end{verbatim}
\end{document}
